<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest updated build of ARCHICAD based on the override-able parameters:  major_version, localization, and release_type

major_version options include:  20, 21, 22, 23, and 24
location options include:  INT, AUS, AUT, BRA, CHE, CHI, CZE, FIN, FRA, GER, GRE, HUN, ITA, JPN, KOR, NED, NOR, NZE, POL, POR, RUS, SPA, SWE, TAI, TUR, UKI, UKR, USA
release_type options include:  AC, SOLO, and START</string>
	<key>Identifier</key>
	<string>com.github.wycomco.download.ARCHICADUpdate</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ARCHICAD_update</string>
		<key>localization</key>
		<string>INT</string>
		<key>major_version</key>
		<string>23</string>
		<key>release_type</key>
		<string>AC</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>localization</key>
				<string>%localization%</string>
				<key>major_version</key>
				<string>%major_version%</string>
				<key>release_type</key>
				<string>%release_type%</string>
			</dict>
			<key>Processor</key>
			<string>ARCHICADUpdatesProcessor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
				<key>url</key>
				<string>%url%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/*.app</string>
				<key>requirement</key>
				<string>identifier "com.graphisoft.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3E9E9FN277"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
