<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for the latest version of Kubus' BIMcollab ZOOM.</string>
	<key>Identifier</key>
	<string>com.github.wycomco.bimcollab_zoom.pkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BIMcollab ZOOM</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>0.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.wycomco.bimcollab_zoom.download</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>extract_root</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				<key>pkg_path</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>PkgExtractor</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Abstract.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "Kubus.BIMcollab-ZOOM" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y6ZY6GR8Y3)</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
